Repository: Pixeval/Pixeval
Catalog: src/Pixeval/Strings/*/MacroParser.resw
Source language: en_us
Languages: fr_fr, ru_ru

# NonParameterizedMacroBearingParameterFormatted
source: 宏{0}不能包含任何参数
fr_fr: Le macro {0} ne peut contient aucun paramètre
ru_ru: Макрос {0} не может содержать параметров

# MacroShouldBeInLastSegmentFormatted
source: 宏{0}必须在文件名上
fr_fr: Le macro {0} doit être utilisé dans un nom de fichier
ru_ru: Макрос {0} должен быть в последнем сегменте имени файла

# MacroShouldBeContainedFormatted
source: 宏{0}应该被包含在条件宏{1}内
fr_fr: Le macro {0} doit être contenu dans un macro de condition {1}
ru_ru: Макрос {0} должен быть внутри условного макроса {1}

# NegationNotAllowedFormatted
source: 宏{0}不能使用反模式
fr_fr: Les négations ne peuvent être utilisées dans le macro {0}
ru_ru: Макрос {0} не может использовать отрицание

# ParameterizedMacroMissingParameterFormatted
source: 条件宏{0}参数缺失
fr_fr: Le macro conditionnnel {0} manque un paramètre
ru_ru: Условный макрос {0} отсутствует параметр

# ResultIsEmpty
source: 解析失败：解析结果为空
fr_fr: Erreur de parsing: le résultat est vide
ru_ru: Ошибка разбора: результат пуст

# UnexpectedTokenFormatted
source: 输入非法：在第{0}个字符处遇到了非法符号
fr_fr: Entrée illégale: symbole non voulu dans l'offset {0} des caractères
ru_ru: Недопустимый ввод: недопустимый символ на позиции {0}

# UnknownArtist
source: 未知作者
fr_fr: Auteur inconnu
ru_ru: Неизвестный художник

# UnknownIllustrationTitle
source: 未知作品
fr_fr: Titre d'illustration inconnu
ru_ru: Неизвестное произведение

# UnknownMacroNameFormatted
source: 未知的宏名称：{0}
fr_fr: Nom de macro inconnu: {0}
ru_ru: Неизвестное имя макроса: {0}

# FilterQueryError
source: 过滤查询语句错误
fr_fr: Erreur de query du filtrage
ru_ru: Ошибка в фильтре запроса

# FilterTokenFinishedFormatted
source: 期望获取的符号：{0}，实际访问到语句末尾
fr_fr: Symbol {0} voulu, mais le query est terminé
ru_ru: Ожидаемый символ: {0}, достигнут конец строки

# UnexpactedTokenFormatted
source: 期望获取的符号：{0}，实际获取到的符号：{1}
fr_fr: Symbol {0} voulu, mais {1} rencontré
ru_ru: Ожидаемый символ: {0}, фактический символ: {1}

# UnbalancedParFormatted
source: 括号不匹配，首个不匹配括号：{0}
fr_fr: Des parenthèses ne s'accordent, la première position d'impaire: {0}
ru_ru: Несоответствие скобок, первая несоответствующая скобка: {0}

# ParserOutOfRange
source: 解析器超出范围
fr_fr: Le parseur est en dehors de la portée
ru_ru: Парсер вышел за пределы диапазона

# ExpectedAndOrAfterLeftParFormatted
source: 在"("后应该跟随"and"或者"or"，实际值：{0}
fr_fr: Un "(" doit être suivi par un "and" ou "or", actuel: {0}
ru_ru: После "(" должно быть "and" или "or", фактическое значение: {0}

# ExpectedTokenAfterAtMarkFormatted
source: 在"@"后应该跟随作者名称或者作者ID，实际值：{0}
fr_fr: Un "@" doit être suivi par un nom d'auteur ou son ID, actuel: {0}
ru_ru: После "@" должно быть имя автора или его ID, фактическое значение: {0}

# IndexRangeUsedMoreThanOnce
source: 索引范围最多指定一次
fr_fr: Au plus un range est valide
ru_ru: Диапазон индексов может быть указан только один раз

# InvalidConstraintFormatted
source: 无效的约束，有效值：{0}，实际值：{1}
fr_fr: Contraint illégal, valeur valide: {0}, actuel: {1}
ru_ru: Неверное ограничение, допустимые значения: {0}, фактическое значение: {1}

# NumericTooLargeFormatted
source: 整数值太大，实际值：{0}
fr_fr: La valeur d'entier est trop large, actuel: {0}
ru_ru: Числовое значение слишком велико, фактическое значение: {0}

# ExpectedAtLeastTwoNumericInDateFormatted
source: 表示日期至少需要两个数字（月、日），实际值：{0}
fr_fr: Au moins deux chiffres (MM-dd) sont nécessaire pour représenter une date, actuel: {0}
ru_ru: Для даты необходимо минимум два числовых значения (месяц, день), фактическое значение: {0}

# ExpectedRightBracketOrParenInRangeFormatted
source: 在范围中应以")"或者"]"结尾，实际值：{0}
fr_fr: Un segment de type portée (range) doit se termine avec soit ')' ou ']', valeur actuelle: {0}
ru_ru: Диапазон должен заканчиваться ")" или "]", фактическое значение: {0}

# NumericTooSmallInRangeFormatted
source: 范围中整数值太小，实际值：{0}
fr_fr: Le nombre entier dans la portée est trop petit, actuellement: {0}
ru_ru: Числовое значение в диапазоне слишком мало, фактическое значение: {0}

# MinimumShouldBeSmallerThanMaximiumFormatted
source: 范围中最小值（{0}）应小于最大值（{1}）
fr_fr: La valeur minimale ({0}) dans la portée doit être strictement inférieure à la valeur maximale ({1})
ru_ru: Минимальное значение диапазона ({0}) должно быть меньше максимального значения ({1})
